# for i in range(10, 1000, 157):
#     print(i)

# Выведите числа от 0 до 500,
# которые кратны 100

for i in range(100, 501, 100):
    print(i)
