# Напишите функцию,
# которая принимает год рождения и
# возвращает ваш возраст

def get_age(year):
    now = 2024
    return now - year

print(get_age(2000))
