# Создайте переменные a и b и присвойте им значения
# 10 и 3 соответственно. Выведите результаты операций
# сложения, вычитания, умножения и деления a на b.

a = 10
b = 3

print(a + b, a - b)
print(a * b)
print(a / b)
print(a ** b)
